import React from 'react'
import { Link } from 'react-router-dom'
import styles from './about.module.css'
import Button from '../../components/button/button'

export default function not_found(){
    return (
        <>
            <div className={styles.container}>
                <h1>Як користуватися веб-програмою</h1>
                <h3>
                    Якщо ви це бачити, це означає, що вам вдалося зареєструватися.
                    В нашій програмі є два типа акаунтів: той хто надає допомогу та той хто потребує цього.
                </h3>
                <h2>Той хто надає допомогу:</h2>
                <h3>
                    Коли ви тільки зайшли в акаунт, вас перекине на головну сторінку зі запитами про допомогу
                    від різних користувачів. На кожному запиті ви можете побачити: зображення, назва запиту
                    місце та час. Якщо ви нажмете на зображення, то знизу появиться нижній драйвер на якому
                    помітите номер телефону цього користувача, щоб ви могли позвонити та домовитися про 
                    допомогу, та опис. Якщо ви хочете зберегти пару запитів, ви можете нажати на лайки і
                    підтвердити. Ці запити появляться на сторінці "Selected". Також ви можете шукати
                    підходящий вам запит, задопомогою пошуку по його назві. 
                </h3>
                <h2>Той хто потребує допомоги:</h2>
                <h3>
                    Коли ви тільки зайшли в акаунт, вас перекине на головну сторінку, яка буде пустою. 
                    Логічно, що вам немає потреби знаходити запити інших користувачів. Проте ви можете
                    створити свій власний, нажавши на "Add". У ньому ви побачите: загрузка зображення до
                    50 КБ, назва, опис, локація та номер телефону. Вводи всі потрібні вам данні та нажимаєте
                    підтвердити. Ваш запит з'явитися в "Main". Якщо вам більше не потрібна допомога, або ви
                    зробили помилку при створенні запиту, ви можете його видалити, нажавши на смітник. Він
                    працює аналогічно як з лайками.                
                </h3>
                <h2>Сторінка Profile:</h2>
                <h3>
                    На цій сторінци ви можете вийти з аканту, взнати про наш веб-додаток та зв'язатися з нами,
                    нажавши на "Support"
                </h3>
                <div className={styles.box}><Link to="/main_page">Повернутися назад</Link></div>
            </div>
        </>
    )
}
